In [1]:
!pip install faker

Collecting faker
  Downloading Faker-20.0.0-py3-none-any.whl (1.7 MB)
Requirement already satisfied: python-dateutil>=2.4 in c:\users\hp\anaconda3\lib\site-packages (from faker) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.4->faker) (1.16.0)
Installing collected packages: faker
Successfully installed faker-20.0.0

In [7]:
import numpy as np
import pandas as pd
from faker import Faker
import random
import datetime

In [8]:
fake=Faker()

In [9]:
#Making Table having Customer Details

customers=[]
for i in range(1,501):
    name=fake.name()
    age=random.randint(18,80)
    gender=random.choice(['Male','Female'])
    address=fake.address().replace('\n',', ')
    customers.append((i,name,age,gender,address))


customer_df=pd.DataFrame(customers,columns=['Customer ID','Name','Age','Gender','Address'])
customer_df.head()

,Customer ID,Name,Age,Gender,Address
0,1,Patricia Beard,42,Female,"434 Dorothy Plain, North Marvin, NY 77799"
1,2,Sydney Smith,44,Male,"26460 Harvey Mall, Donnatown, WY 51312"
2,3,Michelle Pugh,69,Female,"176 Douglas Streets, Parkerville, SD 18484"
3,4,Allen Watts,74,Male,"3508 Elizabeth Mission, West Nicolefort, MP 96685"
4,5,Megan Johnson,41,Female,"07708 Christina Street, Matthewsview, IN 49601"

In [10]:
#Making Table having Transaction Details

transactions=[]


for customer_id in range(1,501):
    for _ in range(random.randint(5,50)):
        transaction_date=fake.date_between(start_date='-2y',end_date='today')
        amount = round(random.uniform(10,1000),2)
        transactions.append((customer_id,transaction_date,amount))

transaction_df = pd.DataFrame(transactions,columns=['CustomerID','TransactionDate','Amount'])

transaction_df.head()

   CustomerID TransactionDate  Amount
0           1      2023-02-16  760.09
1           1      2023-03-12  246.38
2           1      2022-01-30  685.23
3           1      2021-12-22  927.29
4           1      2023-02-23  747.81

## Converting DataFrame to CSV files

In [15]:
#Customer and Transaction are saved file names

customer_df.to_csv('Customers.csv',index=False)     
transaction_df.to_csv('Transaction.csv',index=False)
print('Synthetic banking data generated and saved to CSV files.')

Synthetic banking data generated and saved to CSV files.

## Importing those CSV files

In [12]:
customers=pd.read_csv('Customers.csv')
transactions=pd.read_csv('Transaction.csv')

In [13]:
customers.head()

,Customer ID,Name,Age,Gender,Address
0,1,Patricia Beard,42,Female,"434 Dorothy Plain, North Marvin, NY 77799"
1,2,Sydney Smith,44,Male,"26460 Harvey Mall, Donnatown, WY 51312"
2,3,Michelle Pugh,69,Female,"176 Douglas Streets, Parkerville, SD 18484"
3,4,Allen Watts,74,Male,"3508 Elizabeth Mission, West Nicolefort, MP 96685"
4,5,Megan Johnson,41,Female,"07708 Christina Street, Matthewsview, IN 49601"

In [14]:
transactions.head()

   CustomerID TransactionDate  Amount
0           1      2023-02-16  760.09
1           1      2023-03-12  246.38
2           1      2022-01-30  685.23
3           1      2021-12-22  927.29
4           1      2023-02-23  747.81